scripts/load-test.yml
# Lightweight load test for critical API paths.
# Run: npx artillery run scripts/load-test.yml
# Requires: npm install -g artillery (or npx artillery)
# Covers critical paths per docs/APM_AND_MONITORING.md
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 3
scenarios:
  - name: "scheduler queue"
    flow:
      - get:
          url: "/api/scheduler/queue"
  - name: "error monitoring health"
    flow:
      - get:
          url: "/api/settings/error-monitoring?action=health"
  - name: "twitter profile"
    flow:
      - get:
          url: "/api/twitter/profile"
  - name: "analytics summary"
    flow:
      - get:
          url: "/api/analytics/summary"
  - name: "scheduled posts list"
    flow:
      - get:
          url: "/api/scheduled-posts"
  - name: "analytics posts"
    flow:
      - get:
          url: "/api/analytics/posts"