scripts/load-test.yml
# Lightweight load test for critical API paths.
# Run: npx artillery run scripts/load-test.yml
# Requires: npm install -g artillery (or npx artillery)
# Covers critical paths per docs/APM_AND_MONITORING.md
#
# Authentication: A beforeScenario hook (load-test-auth-processor.js) performs
# a login request and injects the session cookies into subsequent requests.
# All scenario requests send the Cookie header (variable: authCookie) so
# protected endpoints return real responses.
#
# Env (optional): LOAD_TEST_EMAIL, LOAD_TEST_PASSWORD. Defaults (dev): demo@socialautopilot.com / demo123456.
# Optional: LOAD_TEST_TARGET to override config.target (e.g. https://staging.example.com).
config:
  target: "http://localhost:3000"
  processor: "./load-test-auth-processor.js"
  phases:
    - duration: 20
      arrivalRate: 3
  defaults:
    headers:
      Cookie: "{{ authCookie }}"
scenarios:
  - name: "scheduler queue"
    flow:
      - get:
          url: "/api/scheduler/queue"
  - name: "error monitoring health"
    flow:
      - get:
          url: "/api/settings/error-monitoring?action=health"
  - name: "twitter profile"
    flow:
      - get:
          url: "/api/twitter/profile"
  - name: "analytics summary"
    flow:
      - get:
          url: "/api/analytics/summary"
  - name: "scheduled posts list"
    flow:
      - get:
          url: "/api/scheduled-posts"
  - name: "analytics posts"
    flow:
      - get:
          url: "/api/analytics/posts"